app/controllers/media_items_controller.rb

  def show
    @media_item = MediaItem.find(params[:id])
---
SELECT "media_items".* FROM "media_items" WHERE "media_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]