app/controllers/watchlist_items_controller.rb

INSERT INTO "media_items" ("tmdb_id", "title", "media_type", "overview", "poster_path", "release_date", "created_at", "updated_at") VALUES (550, 'Fight Club', 'movie', NULL, '/pB8BM7pdSp6B6Ih7QZ4DrQ3PmJK.jpg', '1999-10-15', '2025-10-22 23:45:42.102817', '2025-10-22 23:45:42.102817') RETURNING "id"
INSERT INTO "watchlist_items" ("user_id", "media_item_id", "status", "watched_on", "created_at", "updated_at") VALUES (4, 4, 'planned', NULL, '2025-10-22 23:45:42.137046', '2025-10-22 23:45:42.137046') RETURNING "id"
---
  def create
    media = find_or_create_media_item
    item = current_user.watchlist_items.build(media_item: media, status: safe_params[:status] || "planned", watched_on: safe_params[:watched_on])
    if item.save

SELECT "watchlist_items".* FROM "watchlist_items" WHERE "watchlist_items"."user_id" = 4 AND "watchlist_items"."id" = 4 LIMIT 1
UPDATE "watchlist_items" SET "status" = 'watched', "watched_on" = '2025-10-22', "updated_at" = '2025-10-22 23:45:51.904786' WHERE "watchlist_items"."id" = 4
---
  def update
    item = current_user.watchlist_items.find(params[:id])
    if item.update(safe_params)

SELECT "watchlist_items".* FROM "watchlist_items" WHERE "watchlist_items"."user_id" = 4 AND "watchlist_items"."id" = 11 LIMIT 1
DELETE FROM "watchlist_items" WHERE "watchlist_items"."id" = 11
---
  def destroy
    item = current_user.watchlist_items.find(params[:id])
    if item.destroy

SELECT "media_items".* FROM "media_items" WHERE "media_items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "media_items".* FROM "media_items" WHERE "media_items"."tmdb_id" = 812 LIMIT 1
INSERT INTO "media_items" ("tmdb_id", "title", "media_type", "overview", "poster_path", "release_date", "created_at", "updated_at") VALUES (812, 'Aladdin', 'movie', NULL, '/eLFfl7vS8dkeG1hKp5mwbm37V83.jpg', '1992-11-25', '2025-10-23 22:50:18.079808', '2025-10-23 22:50:18.079808') RETURNING "id"
---
  def find_or_create_media_item
    if safe_params[:media_item_id].present?
      MediaItem.find(safe_params[:media_item_id])
    else
      tmdb_id = safe_params[:tmdb_id].to_i
      # Try to fetch from cache first
      media = Rails.cache.fetch("media_item/tmdb_id:#{tmdb_id}", expires_in: 24.hours) do
        MediaItem.find_by(tmdb_id: tmdb_id)
      end

      # If not found, create new media item
      if media.nil?
        media = MediaItem.new(tmdb_id: tmdb_id)
        media.title = safe_params[:title]
        media.media_type = safe_params[:media_type]
        media.poster_path = safe_params[:poster_path]
        media.release_date = safe_params[:release_date]
        media.save!