app/controllers/users/registrations_controller.rb

  def update_api_key
    current_user.tmdb_api_key = params[:tmdb_api_key]
    if current_user.save
---
UPDATE "users" SET "updated_at" = '2025-10-22 23:45:20.535265', "tmdb_api_key" = 'bd3f9a53a8bf560361d51997cf254be2' WHERE "users"."id" = 4